// инкремент (++) и декремент (--).
#include <iostream>   // подключение библиотеки работы с консолью
 
using namespace std;  // пространство имен

void main()
{
	int a = 1,b;

	b = ++a*a;                // инкремент и декремент имеют наивысший приоритет  по другому было бы (а+1)*(a+1)
	cout << b << endl;
	cout << a++ << endl;      // на экран выведется а а потом произойдет операция а + 1
	cout << ++a << endl;	  // на экран выведется (а + 1) а потом а


	int c;
	c += 20;
	с *= 1;
	с /= 20;

	// == и != как в питоне
	// && - и, || - или, != - не
}